---
kind: property
id: P:Autodesk.Revit.DB.MEPConnectorInfo.LinkedConnector
source: html/e7626482-1826-2d22-38e0-507bc97ef243.htm
---
# Autodesk.Revit.DB.MEPConnectorInfo.LinkedConnector Property

The linked connector or Nothing nullptr a null reference ( Nothing in Visual Basic) if there is no linked connector

## Syntax (C#)
```csharp
public Connector LinkedConnector { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - None of the following disciplines is enabled: Mechanical Electrical Piping.